123456*
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SOLUTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PRODAND-1    PIC 9(04) VALUE 1.
       01 PRODAND-2    PIC 9(04) VALUE 1.
       01 RESULT       PIC 9(04).
       PROCEDURE DIVISION.
           GOBACK.
       F01-MULT SECTION.
           MULTIPLY PRODAND-1 BY PRODAND-2 GIVING RESULT.
